<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Pr&eacute;face</title>
      <link rel="stylesheet" href="../includes/docbook.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.65.1">
      <link rel="home" href="index.html" title="Software Engineer's Guide to Developing OpenLaszlo Applications">
      <link rel="up" href="index.html" title="Software Engineer's Guide to Developing OpenLaszlo Applications">
      <link rel="previous" href="index.html" title="Software Engineer's Guide to Developing OpenLaszlo Applications">
      <link rel="next" href="overview.html" title="Part&nbsp;I.&nbsp;Overview"><script type="text/javascript" language="JavaScript" src="../../lps/includes/embed.js"></script><script type="text/javascript" language="JavaScript" src="../../docs/includes/docs.js"></script></head>
   <body class="docbook-tutorial">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">Pr&eacute;face</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="index.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="overview.html">Suivant</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="preface" lang="en">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="preface"></a>Pr&eacute;face</h2>
               </div>
            </div>
            <div></div>
         </div>
         <div class="toc">
            <p><b>Table des mati&egrave;res</b></p>
            <dl>
               <dt><span class="section"><a href="preface.html#d0e41">1. A qui s'adresse ce livre</a></span></dt>
               <dd>
                  <dl>
                     <dt><span class="section"><a href="preface.html#d0e55">1.1. Apprendre en faisant</a></span></dt>
                     <dt><span class="section"><a href="preface.html#d0e63">1.2. Acc&egrave;s s&eacute;quentiel ou al&eacute;atoire</a></span></dt>
                  </dl>
               </dd>
               <dt><span class="section"><a href="preface.html#d0e76">2. Conventions </a><a href="#d0e76">d'&eacute;criture</a></span></dt>
               <dt><span class="section"><a href="preface.html#d0e118">3. Autres lectures</a></span></dt>
               <dt><span class="section"><a href="preface.html#d0e146">4. Programme de lecture conseill&eacute;</a></span></dt>
               <dd>
                  <dl>
                     <dt><span class="section"><a href="preface.html#d0e219">4.1. Utilisation des Forums</a></span></dt>
                  </dl>
               </dd>
            </dl>
         </div>
         <p>Nous avons cr&eacute;&eacute; cette technologie pour rendre possible la cr&eacute;ation d'applications web faciles &agrave; utiliser.</p>
         <p>Tout utilisateur d'ordinateur connait la puissance d'Internet, et chaque surfeur a &eacute;t&eacute; impressionn&eacute; &agrave; un moment ou &agrave; un autre par la richesse du Web. Mais en m&ecirc;me temps chacun sait, m&ecirc;me si c'est inconscient, que les applications orient&eacute;es web qui fonctionnent dans un navigateur proposent une richesse utilisateur inf&eacute;rieure &agrave; celle des applications fonctionnant en local.&nbsp;Il y a quelque chose de presque r&eacute;trograde dans l'utilisation des sites web; ce sont des anomalies, comme peuvent l'&ecirc;tre les t&eacute;l&eacute;phones &agrave; composition par rotation par rapport aux t&eacute;l&eacute;phones &agrave; touches.&nbsp; </p>
			<p>Les raisons sont connues.&nbsp;Et ce n'est pas parce que les graphistes web ne connaissent pas les r&egrave;gles d'ergonomie ou de composition graphique.&nbsp;C'est parce qu'ils n'ont pas eu &agrave; leur disposition les outils dont ils avaient besoin pour concevoir les experiences web qu'ils avaient imagin&eacute;es.</p>
			<p>HTML&nbsp;est une chose formidable; DHTML est une chose formidable.&nbsp;La technologie Flash de Macromedia est une chose formidable.&nbsp;Mais aucune d'entre elles ne permet aux d&eacute;veloppeurs de produire des exp&eacute;riences innoubliables &agrave; l'utilisateur, parce que toutes sont bas&eacute;es sur des mod&egrave;les fondamentalement limit&eacute;s.&nbsp;Les variantes de HTML&nbsp;sont bas&eacute;es sur la m&eacute;taphore de la &quot;page&quot;, ce qui force les utilisateurs &agrave; traiter les informations de fa&ccedil;on arbitrairement morcel&eacute;e par des transitions brutales et des rafraichissements de pages.&nbsp;Flash offre la possibilit&eacute; d'une navigation beaucoup plus continue, mais sa m&eacute;taphore de &quot;film&quot; force les d&eacute;veloppeurs &agrave; laisser de c&ocirc;t&eacute; de nombreux outils et techniques essentiels des d&eacute;veloppements de logiciels modernes.</p>
			<p>A l'inverse, la solution OpenLaszlo a &eacute;t&eacute; con&ccedil;ue enti&egrave;rement pour le d&eacute;veloppement d'applications - pas de d&eacute;veloppement par &quot;page&quot;, pas de d&eacute;veloppement par &quot;film&quot; - en se basant sur des approches standard de d&eacute;veloppement.&nbsp;Les applications LZX sont &eacute;crites dans des fichiers XML embarquant du code JavaScript, ce qui fournit des fondations id&eacute;ales pour des &eacute;quipes s&eacute;rieuses de d&eacute;veloppement.&nbsp;OpenLaszlo s'appuie sur les concepts standards de d&eacute;veloppement orient&eacute; objet et de liaison de donn&eacute;es, et permet de grandes int&eacute;ractivit&eacute;s sans faire appel &agrave; une conception complexe bas&eacute;e sur des scripts temporels.<span class="trademark"></span></p>
			<p>Le r&eacute;sultat, ce sont des applications g&eacute;niales &agrave; utiliser.&nbsp;Maintenant, pour vous faire votre propre opinion, nous vous sugg&eacute;rons d'en faire l'exp&eacute;rience avec cette application de <a href="../../demos/amazon/amazon.lzx" target="_top">e-commerce</a>. Ce programme communique avec les serveurs de donn&eacute;es de Amazon.com et vous permet de naviguer dans leurs produits, de cr&eacute;er une liste de s&eacute;lection, de remplir un caddie, et ainsi de suite. Donc de bien des fa&ccedil;ons, c'est comme n'importe quel autre site d'e-commerce. Mais remarquez qu'il n'y a aucun rafraichissement d'&eacute;cran, et que vous pouvez d&eacute;placer les produits en les faisant glisser avec la souris et qu'il est difficile de se &quot;perdre&quot;. Maintenant consid&eacute;rez le fait que ce programme a &eacute;t&eacute; &eacute;crit en seulement quelques heures en utilisant un simple &eacute;diteur de texte.</p>
			<p>Nous vous sugg&eacute;rons de vous amuser parmi les dizaines d'exemples <a href="../../demos/" target="_top">ici</a> ou sur le <a href="http://www.laszlosystems.com/demos/" target="_top">site web</a> de Laszlo Systems pour vous rendre compte de ce &agrave; quoi ressemble une application Laszlo. On entend parfois parler de &quot;clients riches&quot; pour d&eacute;crire les applications commes celles-l&agrave;, et leur caract&eacute;ristique est qu'ils rendent les gens heureux. Un nombre grandissant d'&eacute;tudes montre que quand les utilisateurs sont heureux sur un site web, plus longtemps ils y restent, et sur des sites commerciaux, plus ils consomment.</p>
			<p></p>
			<div class="section" lang="en">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="d0e41"></a>1.&nbsp;A qui s'adresse ce livre</h2>
                  </div>
               </div>
               <div></div>
            </div>
            <p>Ce livre est &eacute;crit pour les d&eacute;veloppeurs d'applications qui sont familiers avec les concepts de programmation orient&eacute;e objet tels qu'ils peuvent &ecirc;tre impl&eacute;ment&eacute;s dans des langages tels que Java, C++ ou JavaScript, et avec les bases des formats de donn&eacute;es XML.</p>
				<p>Nous esp&eacute;rons &eacute;galement que ce guide sera accessible &agrave; des d&eacute;veloppeurs web qui connaissent HTML et les CSS mais n'ont pas encore travaill&eacute; avec des langages orient&eacute;s objet, et &agrave; des d&eacute;veloppeurs et graphistes familiers avec Flash et FlashMX.&nbsp;Si vous en faites partie, vous pourriez avoir un peu de travail suppl&eacute;mentaire &agrave; fournir en dehors du cadre de ce livre, mais vous ne devriez pas avoir de difficult&eacute;s &agrave; devenir un d&eacute;veloppeur LZX parlant couramment lZX.&nbsp;Les <a target="laszlo-dguide" href="./">tutoriels</a> sont un bon endroit pour commencer &agrave; apprendre.</p>
				<p></p>
				<div class="section" lang="en">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e55"></a>1.1.&nbsp;Apprendre en faisant</h3>
                     </div>
                  </div>
                  <div></div>
               </div>
               <p>Ce guide contient des centaines d'exemples &quot;interactifs&quot;, c'est &agrave; dire que ce sont des applications Laszlo qui sont embarqu&eacute;es dans les pages.&nbsp;Vous aurez plus de plaisir et tirerez davantage des exemples si vous &quot;jouez avec le code&quot;.&nbsp;Pour cela, cliquez simplement sur le lien &quot;Edit&quot; dans le coin inf&eacute;rieur droit de chaque exemple.&nbsp;Une nouvelle fen&ecirc;tre apparaitra contenant un environnement suffisant pour modifier et ex&eacute;cuter des applications Laszlo.&nbsp;Editez le code des exemples et cliquez sur &quot;update&quot; pour voir les r&eacute;sultats affich&eacute;s sur la partie droite de la fen&ecirc;tre.&nbsp;Pour revenir &agrave; l'&eacute;tat initial du code de l'exemple, cliquez sur &quot;Reset&quot;.</p>
					<p>Si vous voulez sauver une copie de l'application pour une utilisation ult&eacute;rieure, cliquez sur le bouton &quot;Save As&quot;.</p>
					<p></p>
				</div>
				<div class="section" lang="en">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e63"></a>1.2.&nbsp;Acc&egrave;s s&eacute;quentiel ou al&eacute;atoire</h3>
                     </div>
                  </div>
                  <div></div>
               </div>
               <p><span class="i">Les activit&eacute;s graphiques, de d&eacute;veloppement et de d&eacute;ploiement des applications Laszlo peuvent &ecirc;tre envisag&eacute;es de fa&ccedil;on s&eacute;quentielle ou al&eacute;atoire.&nbsp;En g&eacute;n&eacute;ral, chaque chapitre s'appuie sur les concepts d&eacute;velopp&eacute;s dans les chapitres pr&eacute;c&eacute;dents, mais pas (trop) sur les chapitres qui suivent.&nbsp;Si vous commencez au chapitre un et lisez jusqu'&agrave; la fin, vous ne serez pas perdu.&nbsp;</span></p>
					<p><span class="i">D'un autre c&ocirc;t&eacute;, chaque chapitre est con&ccedil;u pour &ecirc;tre encyclop&eacute;dique : le chapitre sur les animations couvre enti&egrave;rement le sujet des animations, et ainsi de suite.&nbsp;</span></p>
					<p>De petits exemples simples sont pr&eacute;sents tout le long.&nbsp;De plus grands exemples leurs sont reli&eacute;s.</p>
					<p></p>
				</div>
         </div>
         <div class="section" lang="en">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="d0e76"></a>2.&nbsp;Conventions d'&eacute;criture</h2>
                  </div>
               </div>
               <div></div>
            </div>
            <p>Le code est affich&eacute; de cette fa&ccedil;on : <tt class="literal">var a = f(2)</tt>. Les plus grandes sections de code et autres informations li&eacute;es sont affich&eacute;es dans un paragraphe s&eacute;par&eacute; :</p>
            <table border="0" bgcolor="#E0E0E0">
               <tr>
                  <td><pre class="programlisting">
Un exemple
qui s'affiche sur
plusieurs lignes
</pre></td>
               </tr>
            </table>
            <p>Les exemples de programmes sont affich&eacute;s de la fa&ccedil;on suivante : </p>
            <div class="informalexample">
               <table border="0" bgcolor="#E0E0E0">
                  <tr>
                     <td><pre class="programlisting">&lt;canvas height="20"&gt;
  &lt;text&gt;Hello World!&lt;/text&gt;
&lt;/canvas&gt;</pre></td>
                  </tr>
               </table>
            </div>
            <p>Certains programmes exemples fonctionnent &agrave; l'int&eacute;rieur de la page.&nbsp;L'application active est affich&eacute;e la premi&egrave;re, suivie par son code source, suivi lui-m&ecirc;me par un bouton 'edit' qui vous permet de modifier l'application en proc&eacute;dant &agrave; des changement dans son code source.</p>
            <div class="informalexample">
               <div class="embedded-canvas"><script language="JavaScript" type="text/javascript">lzEmbed({url: 'programs/preface-$2.lzx?lzt=swf', width: 500, height: height="20"});
            </script></div>
               <table border="0" bgcolor="#E0E0E0">
                  <tr>
                     <td><pre class="programlisting">&lt;canvas height="20"&gt;
  &lt;text&gt;Hello World!&lt;/text&gt;
&lt;/canvas&gt;</pre></td>
                  </tr>
               </table>
               
               <div class="edit-button"><a href="../../laszlo-explorer/editor.jsp?src=docs/guide/programs/preface-$2.lzx" target="lzview"><img border="0" alt="" height="18" width="42" src="../../docs/includes/d_t_editbutton.gif"></a></div>
               
            </div>
            <p></p>
         </div>
         <div class="section" lang="en">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="d0e118"></a>3.&nbsp;Autres lectures</h2>
                  </div>
               </div>
               <div></div>
            </div>
            <p>En plus de ce <em>guide de d&eacute;veloppement</em>, nous vous conseillons de consulter :</p>
            <div class="itemizedlist">
               <ul type="disc" compact>
                  <li>
                     <p>Le <a target="laszlo-reference" href="../reference/../reference/"><span class="em">Manuel de R&eacute;f&eacute;rence LZX</span>
                           </a>. Cette r&eacute;f&eacute;rence dynamique avec liens hypertextes, contient une explication de chaque balise LZX et de ses biblioth&egrave;ques (API). Son format sera familier aux utilisateurs de la JavaDoc(tm) ou d'autres outils similaires.</p>
                  </li>
                  <li>
                     <p>Le <a target="laszlo-dguide" href="../guide/">tutoriel en ligne</a> et les exemples d'applications sur <a href="http://www.laszlosystems.com/demos" target="_top">http://www.laszlosystems.com/demos</a> fournissent un panorama intructif du langage LZX.</p>
                  </li>
               </ul>
            </div>
            <p></p>
         </div>
         <div class="section" lang="en">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="d0e146"></a>4.&nbsp;Programme de lecture conseill&eacute;</h2>
                  </div>
               </div>
               <div></div>
            </div>
            <p>La meilleure fa&ccedil;on d'utiliser ce guide du d&eacute;veloppeur d&eacute;pend de votre exp&eacute;rience.&nbsp;</p>
				<p><em>D&eacute;veloppeurs exp&eacute;riment&eacute;s en programmation orient&eacute;e objet</em> : nous vous conseillons de commencer par lire les chapitres 1,&nbsp;2 et 4&nbsp;de ce guide.&nbsp;Si vous n'avez jamais travaill&eacute; avec JavaScript, vous pouvez apprendre rapidement ses bases dans l'un des tutoriels des sites <a href="http://www.w3schools.com/js/default.asp" target="_top">W3Schools</a>, <a href="http://www.wdvl.com/Authoring/JavaScript/Tutorial/" target="_top">WVDL</a>, ou <a href="http://www.pageresource.com/jscript/" target="_top">PageResource.com</a>. Naviguez alors &agrave; travers le site de Laszlo Systems et le site de d&eacute;monstration <a href="http://mylaszlo.com" target="_top">MyLaszlo.com</a> et jouez avec les tutoriels et les exemples de code et de programmes; en m&ecirc;me temps que vous lisez le code des exemples, reportez vous bien au <em>manuel de r&eacute;f&eacute;rence</em>.&nbsp;De l&agrave;, vous saurez de quelle autre lecture vous aurez besoin dans ce guide.</p>
				<p><span class="em">D&eacute;veloppeurs Web/Flash sans experience de programmation orient&eacute;e objet:</span> nous vous sugg&eacute;rons de commencer avec les <a target="laszlo-dguide" href="../guide/">tutoriels</a> pour avoir une id&eacute;e g&eacute;n&eacute;rale de la programmation LZX. Ne vous en faites pas si vous ne ma&icirc;trisez pas les sujets qui sont couverts; votre but est de vous habituer au langage.</p>
				<p>Si vous en avez besoin, apprenez les bases de <a href="http://www.w3.org/XML/" target="_top">XML</a>.
            </p>
            <p>Alors lisez la suite <a href="overview.html" title="Part&nbsp;I.&nbsp;Overview">I, &ldquo;Aper&ccedil;u G&eacute;n&eacute;ral&rdquo;</a>.
            </p>
            <p></p>
            <div class="section" lang="en">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e219"></a>4.1.&nbsp;Utilisation des Forums</h3>
                     </div>
                  </div>
                  <div></div>
               </div>
               <p>La meilleure fa&ccedil;on d'apprendre n'importe quel langage de programmation est de s'appuyer sur l'exp&eacute;rience et la bonne volont&eacute; de sa communaut&eacute; de d&eacute;veloppeurs (et d'&eacute;crire du code, car comme on dit, personne n'apprendra jamais &agrave; faire du v&eacute;lo en lisant des livres).&nbsp;La communaut&eacute; de d&eacute;veloppeurs LZX se rencontre &agrave; l'adresse <a href="http://www.laszlosystems.com/developers/forums/" target="_top">http://www.laszlosystems.com/developers/forums/</a>. Vous trouverez l&agrave; des discussions actives sur tous les aspects du langage et pourrez poser vos propres questions.&nbsp;</p>
               <p></p>
            </div>
         </div>
      </div>
      <hr>
      <p class="copyright">Copyright &copy; 2002-2005 <a target="_top" href="http://www.laszlosystems.com/">Laszlo Systems, Inc.</a>
         All Rights Reserved. Unauthorized use, duplication or
         distribution is strictly prohibited. This is the proprietary
         information of Laszlo Systems, Inc. Use is subject to license terms.
      </p>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="index.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="index.html">Haut</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="overview.html">Suivant</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">Guide du d&eacute;veloppeur d'applications OpenLaszlo</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td>
               <td width="40%" align="right" valign="top">&nbsp;I.&nbsp;Aper&ccedil;u G&eacute;n&eacute;ral</td>
            </tr>
         </table>
      </div>
   </body>
</html>
<!-- * X_LZ_COPYRIGHT_BEGIN ***************************************************
* Copyright 2006 Laszlo Systems, Inc.  All Rights Reserved.                   *
* Use is subject to license terms.                                            *
* X_LZ_COPYRIGHT_END ****************************************************** -->
